In [9]:
import pandas as pd
import numpy as np

In [12]:
series = pandas.Series([1,2,3,4,5])
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
print(series.index)
print(series.values)

RangeIndex(start=0, stop=5, step=1)
[1 2 3 4 5]

In [15]:
series2 = pd.Series(['a', 'b', 'c', 1, 2, 3])
series2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [16]:
series3 = pd.Series([np.nan, 1, 2])
series3

0    NaN
1    1.0
2    2.0
dtype: float64

In [20]:
date = ['2023-12-10','2023-12-11','2023-12-12','2023-12-13']
series4 = pd.Series([1,2,np.nan,4],index=date)
series4

2023-12-10    1.0
2023-12-11    2.0
2023-12-12    NaN
2023-12-13    4.0
dtype: float64

In [21]:
dict = {'국어': 80, '영어': 90, '수학': 100}
pds = pd.Series(dict)
pds

국어     80
영어     90
수학    100
dtype: int64

In [22]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([6,7,8,9,10])

In [23]:
s1+s2

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [24]:
s1-s2

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [25]:
s1*s2

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [26]:
s1/s2

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

In [27]:
pd.date_range(start='2023-12-10',end='2023-12-13')

DatetimeIndex(['2023-12-10', '2023-12-11', '2023-12-12', '2023-12-13'], dtype='datetime64[ns]', freq='D')

In [29]:
print(pd.date_range(start = '2023-12-10', periods = 6, freq = '2D'))
print(pd.date_range(start = '2023-12-10', periods = 6, freq = 'W'))
print(pd.date_range(start = '2023-12-10', periods = 12, freq = '2BM'))
print(pd.date_range(start = '2023-12-10', periods = 4, freq = 'QS'))
print(pd.date_range(start = '2023-12-10', periods = 2, freq = 'AS'))

DatetimeIndex(['2023-12-10', '2023-12-12', '2023-12-14', '2023-12-16',
               '2023-12-18', '2023-12-20'],
              dtype='datetime64[ns]', freq='2D')
DatetimeIndex(['2023-12-10', '2023-12-17', '2023-12-24', '2023-12-31',
               '2024-01-07', '2024-01-14'],
              dtype='datetime64[ns]', freq='W-SUN')
DatetimeIndex(['2023-12-29', '2024-02-29', '2024-04-30', '2024-06-28',
               '2024-08-30', '2024-10-31', '2024-12-31', '2025-02-28',
               '2025-04-30', '2025-06-30', '2025-08-29', '2025-10-31'],
              dtype='datetime64[ns]', freq='2BM')
DatetimeIndex(['2024-01-01', '2024-04-01', '2024-07-01', '2024-10-01'], dtype='datetime64[ns]', freq='QS-JAN')
DatetimeIndex(['2024-01-01', '2025-01-01'], dtype='datetime64[ns]', freq='AS-JAN')

In [31]:
pd.DataFrame([[1,2,3],
              [4,5,6],
              [7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [33]:
table = {'이름' : ['홍길동', '이길동', '정길동', '나길동', '천길동'],
        '혈액형' : ['O형', 'A형', 'B형', 'AB형', 'O형'],
        '나이' : [82,19,42,50,30]}

In [34]:
pd.DataFrame(table)

    이름  혈액형  나이
0  홍길동   O형  82
1  이길동   A형  19
2  정길동   B형  42
3  나길동  AB형  50
4  천길동   O형  30

In [40]:
data1 = pd.DataFrame(table, columns = ['이름','나이','혈액형'])
data1

    이름  나이  혈액형
0  홍길동  82   O형
1  이길동  19   A형
2  정길동  42   B형
3  나길동  50  AB형
4  천길동  30   O형

In [42]:
data1.index

RangeIndex(start=0, stop=5, step=1)

In [43]:
data1.values

array([['홍길동', 82, 'O형'],
       ['이길동', 19, 'A형'],
       ['정길동', 42, 'B형'],
       ['나길동', 50, 'AB형'],
       ['천길동', 30, 'O형']], dtype=object)

In [44]:
df1 = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                    'B': [11, 22, 33, 44, 55],
                    'C': [111, 222, 333, 444, 555]})
df2 = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                    'B': [11, 22, 33, 44, 55],
                    'C': [111, 222, 333, 444, 555]})

In [45]:
df1, df2

(   A   B    C
 0  1  11  111
 1  2  22  222
 2  3  33  333
 3  4  44  444
 4  5  55  555,
    A   B    C
 0  1  11  111
 1  2  22  222
 2  3  33  333
 3  4  44  444
 4  5  55  555)

In [46]:
df1+df2

    A    B     C
0   2   22   222
1   4   44   444
2   6   66   666
3   8   88   888
4  10  110  1110

In [47]:
df1-df2

   A  B  C
0  0  0  0
1  0  0  0
2  0  0  0
3  0  0  0
4  0  0  0

In [48]:
df1*df2

    A     B       C
0   1   121   12321
1   4   484   49284
2   9  1089  110889
3  16  1936  197136
4  25  3025  308025

In [49]:
df1/df2

     A    B    C
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0
4  1.0  1.0  1.0

In [51]:
data1.describe()

              나이
count   5.000000
mean   44.600000
std    23.995833
min    19.000000
25%    30.000000
50%    42.000000
75%    50.000000
max    82.000000

In [53]:
data1["이름"], data1["나이"], data1["혈액형"]

(0    홍길동
 1    이길동
 2    정길동
 3    나길동
 4    천길동
 Name: 이름, dtype: object,
 0    82
 1    19
 2    42
 3    50
 4    30
 Name: 나이, dtype: int64,
 0     O형
 1     A형
 2     B형
 3    AB형
 4     O형
 Name: 혈액형, dtype: object)

In [55]:
data1.head(3)

    이름  나이 혈액형
0  홍길동  82  O형
1  이길동  19  A형
2  정길동  42  B형

In [56]:
data1.tail(2)

    이름  나이  혈액형
3  나길동  50  AB형
4  천길동  30   O형

In [58]:
data1.loc[1:5:2]

    이름  나이  혈액형
1  이길동  19   A형
3  나길동  50  AB형

In [60]:
data1.info

<bound method DataFrame.info of     이름  나이  혈액형
0  홍길동  82   O형
1  이길동  19   A형
2  정길동  42   B형
3  나길동  50  AB형
4  천길동  30   O형>

In [63]:
data1.iloc[1:3]

    이름  나이 혈액형
1  이길동  19  A형
2  정길동  42  B형